/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: ลดความซ้ำซ้อน: ทำให้เราสามารถสร้างฟังก์ชันหลัก (Higher-Order) เพียงตัวเดียวเพื่อจัดการโครงสร้างการทำงานรวมๆ แล้วส่งฟังก์ชันย่อย (Callback) เพื่อเปลี่ยนพฤติกรรมด้านใน ไม่ต้องเขียนโค้ดโครงสร้างเดิมซ้ำๆ
เพิ่มความยืดหยุ่น: หากต้องการเพิ่มแอคชันใหม่ๆ ในระบบ ก็เพียงแค่เขียน Callback function ตัวใหม่เพิ่มโดยไม่ต้องไปแก้ไขหรือรื้อโค้ดของฟังก์ชันหลักเลย


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer: โค้ดอ่านง่ายขึ้นและเป็นสัดส่วนมากขึ้น เพราะแทนที่จะต้องสร้างฟังก์ชันหลักขนาดใหญ่ การใช้ Callback ช่วยให้เราแยกข้อความหรือแอคชันแต่ละประเภทเป็นฟังก์ชันเล็กๆ ที่มีชื่อสื่อความหมายชัดเจน (เช่น postLiked, postShared)


3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  การเรียกใช้งานแอปพลิเคชันสั่งอาหาร
Higher-Order Function (ตัวแอป / ไรเดอร์): มีหน้าที่และกระบวนการทำงานหลักที่ตายตัว คือ รับออเดอร์ ขับรถไปร้าน ซื้อของ และนำมาส่ง
Callback Function (โน้ตคำสั่งพิเศษ): คือรายละเอียดเฉพาะเจาะจงที่เราฝากไรเดอร์ไปทำ เช่น "กะเพราไม่ใส่ถั่วฝักยาว"


*/
